loranodes/arduino-core-v2/microNode/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

# microNode
# ------------------------------
microNode.name=microNodeV2
microNode.vid.0=0x1bda
microNode.pid.0=0xe185
microNode.vid.1=0x1bda
microNode.pid.1=0xe185
microNode.upload.tool=bossac
microNode.upload.protocol=sam-ba
microNode.upload.maximum_size=262144
microNode.upload.offset=0x2000
microNode.upload.use_1200bps_touch=true
microNode.upload.wait_for_upload_port=true
microNode.upload.native_usb=true
microNode.build.mcu=cortex-m0plus
microNode.build.f_cpu=48000000L
microNode.build.usb_product="microNode"
microNode.build.usb_manufacturer="UoS"
microNode.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
microNode.build.core=arduino
microNode.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DADAFRUIT_CIRCUITPLAYGROUND_M0 {build.usb_flags}
microNode.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
microNode.build.openocdscript=openocd_scripts/arduino_zero.cfg
microNode.build.variant=micronode
microNode.build.variant_system_lib=
microNode.build.vid=0x1bda
microNode.build.pid=0xe185
microNode.bootloader.tool=openocd